Add prettier, use mermaid in readme
